# PanelMismatchDistSysWhenCircuitAssigned Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..PanelMismatchDistSysWhenCircuitAssigned Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The selected circuit was added to panel [Element], but the distribution system for the panel does not match the power connector definition on the panel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PanelMismatchDistSysWhenCircuitAssigned { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PanelMismatchDistSysWhenCircuitAssigned As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PanelMismatchDistSysWhenCircuitAssigned {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace